### appending or concat stacks add rows
joining adds related columns from one dataframe to another based on common values

In [1]:
import pandas as pd

In [2]:
retail = pd.read_csv("./retail/retail_2016_2017.csv")

In [3]:
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [4]:
automotive = retail.query("family == 'AUTOMOTIVE'").head()

automotive

          id        date  store_nbr      family  sales  onpromotion
0    1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
33   1945977  2016-01-01         10  AUTOMOTIVE    0.0            0
66   1946010  2016-01-01         11  AUTOMOTIVE    0.0            0
99   1946043  2016-01-01         12  AUTOMOTIVE    0.0            0
132  1946076  2016-01-01         13  AUTOMOTIVE    0.0            0

In [10]:
beauty = retail.query("family == 'BEAUTY'").head()

beauty = beauty.assign(new_col = 10)

beauty

          id        date  store_nbr  family  sales  onpromotion  new_col
2    1945946  2016-01-01          1  BEAUTY    0.0            0       10
35   1945979  2016-01-01         10  BEAUTY    0.0            0       10
68   1946012  2016-01-01         11  BEAUTY    0.0            0       10
101  1946045  2016-01-01         12  BEAUTY    0.0            0       10
134  1946078  2016-01-01         13  BEAUTY    0.0            0       10

In [7]:
pd.concat([automotive,beauty],
          ignore_index=True
         )

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945977  2016-01-01         10  AUTOMOTIVE    0.0            0
2  1946010  2016-01-01         11  AUTOMOTIVE    0.0            0
3  1946043  2016-01-01         12  AUTOMOTIVE    0.0            0
4  1946076  2016-01-01         13  AUTOMOTIVE    0.0            0
5  1945946  2016-01-01          1      BEAUTY    0.0            0
6  1945979  2016-01-01         10      BEAUTY    0.0            0
7  1946012  2016-01-01         11      BEAUTY    0.0            0
8  1946045  2016-01-01         12      BEAUTY    0.0            0
9  1946078  2016-01-01         13      BEAUTY    0.0            0

In [9]:
pd.concat([automotive,beauty],
         # ignore_index=True
         ).reset_index()

   index       id        date  store_nbr      family  sales  onpromotion
0      0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1     33  1945977  2016-01-01         10  AUTOMOTIVE    0.0            0
2     66  1946010  2016-01-01         11  AUTOMOTIVE    0.0            0
3     99  1946043  2016-01-01         12  AUTOMOTIVE    0.0            0
4    132  1946076  2016-01-01         13  AUTOMOTIVE    0.0            0
5      2  1945946  2016-01-01          1      BEAUTY    0.0            0
6     35  1945979  2016-01-01         10      BEAUTY    0.0            0
7     68  1946012  2016-01-01         11      BEAUTY    0.0            0
8    101  1946045  2016-01-01         12      BEAUTY    0.0            0
9    134  1946078  2016-01-01         13      BEAUTY    0.0            0

In [11]:
pd.concat([automotive,beauty],
         )

          id        date  store_nbr      family  sales  onpromotion  new_col
0    1945944  2016-01-01          1  AUTOMOTIVE    0.0            0      NaN
33   1945977  2016-01-01         10  AUTOMOTIVE    0.0            0      NaN
66   1946010  2016-01-01         11  AUTOMOTIVE    0.0            0      NaN
99   1946043  2016-01-01         12  AUTOMOTIVE    0.0            0      NaN
132  1946076  2016-01-01         13  AUTOMOTIVE    0.0            0      NaN
2    1945946  2016-01-01          1      BEAUTY    0.0            0     10.0
35   1945979  2016-01-01         10      BEAUTY    0.0            0     10.0
68   1946012  2016-01-01         11      BEAUTY    0.0            0     10.0
101  1946045  2016-01-01         12      BEAUTY    0.0            0     10.0
134  1946078  2016-01-01         13      BEAUTY    0.0            0     10.0

### Exercise 1 concatenating dataframes

In [13]:
transactions = pd.concat(
    (pd.read_csv("transactions_2014.csv"),pd.read_csv("transactions_2015.csv"))
).drop(["Unnamed: 0"], axis=1)

transactions.head()

,Date,Store_Number,Transaction_Count,target_pct,met_target,bonus_payable,month,day_of_week,year
0,2014-01-01,25,840,0.3360,False,False,1,2,2014
1,2014-01-01,36,487,0.1948,False,False,1,2,2014
2,2014-01-02,1,1875,0.7500,False,False,1,3,2014
3,2014-01-02,2,2122,0.8488,False,False,1,3,2014
4,2014-01-02,3,3350,1.3400,True,False,1,3,2014

In [14]:
transactions.tail()

,Date,Store_Number,Transaction_Count,target_pct,met_target,bonus_payable,month,day_of_week,year
18341,2015-12-31,49,3828,1.5312,True,False,12,3,2015
18342,2015-12-31,50,2948,1.1792,True,False,12,3,2015
18343,2015-12-31,51,2892,1.1568,True,False,12,3,2015
18344,2015-12-31,53,2300,0.9200,False,False,12,3,2015
18345,2015-12-31,54,1572,0.6288,False,False,12,3,2015

In [16]:
#excel 
transactions = pd.concat(
    pd.read_excel("TransactionYear.xlsx",sheet_name=[1,2]),
    ignore_index=True
).drop(["Unnamed: 0"], axis=1)

In [17]:
transactions.head()

,Date,Store_Number,Transaction_Count,target_pct,met_target,bonus_payable,month,day_of_week,year
0,2014-01-01,25,840,0.3360,False,False,1,2,2014
1,2014-01-01,36,487,0.1948,False,False,1,2,2014
2,2014-01-02,1,1875,0.7500,False,False,1,3,2014
3,2014-01-02,2,2122,0.8488,False,False,1,3,2014
4,2014-01-02,3,3350,1.3400,True,False,1,3,2014

In [18]:
transactions.tail()

,Date,Store_Number,Transaction_Count,target_pct,met_target,bonus_payable,month,day_of_week,year
35479,2015-12-31,49,3828,1.5312,True,False,12,3,2015
35480,2015-12-31,50,2948,1.1792,True,False,12,3,2015
35481,2015-12-31,51,2892,1.1568,True,False,12,3,2015
35482,2015-12-31,53,2300,0.9200,False,False,12,3,2015
35483,2015-12-31,54,1572,0.6288,False,False,12,3,2015

### join dataframes with merge()
left_df.merge(right_df,
              how,
              left_on,
              right_on)

inner , left, right and outer

In [20]:
transactions = pd.read_csv("./retail/transactions.csv", parse_dates=["date"])

In [21]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [22]:
oil = pd.read_csv("./retail/oil.csv", parse_dates=["date"])

In [23]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   datetime64[ns]
 1   dcoilwtico  1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [24]:
transactions.merge(oil)

            date  store_nbr  transactions  dcoilwtico
0     2013-01-01         25           770         NaN
1     2013-01-02          1          2111       93.14
2     2013-01-02          2          2358       93.14
3     2013-01-02          3          3487       93.14
4     2013-01-02          4          1922       93.14
...          ...        ...           ...         ...
59646 2017-08-15         50          2804       47.57
59647 2017-08-15         51          1573       47.57
59648 2017-08-15         52          2255       47.57
59649 2017-08-15         53           932       47.57
59650 2017-08-15         54           802       47.57

[59651 rows x 4 columns]

In [26]:
transactions.merge(oil,
                  how="inner",
                  left_on =["date"],
                  right_on = ["date"]
                  on=["date"] 
                  ).loc[transactions["date"] == '2013-01-06']

          date  store_nbr  transactions  dcoilwtico
185 2013-01-08          1          1869       93.21
186 2013-01-08          2          1856       93.21
187 2013-01-08          3          2826       93.21
188 2013-01-08          4          1397       93.21
189 2013-01-08          5          1504       93.21
190 2013-01-08          6          1555       93.21
191 2013-01-08          7          1524       93.21
192 2013-01-08          8          2639       93.21
193 2013-01-08          9          2206       93.21
194 2013-01-08         10          1100       93.21
195 2013-01-08         11          2388       93.21
196 2013-01-08         12          1130       93.21
197 2013-01-08         13           879       93.21
198 2013-01-08         14          1673       93.21
199 2013-01-08         15          1330       93.21
200 2013-01-08         16          1009       93.21
201 2013-01-08         17          1197       93.21
202 2013-01-08         18          1388       93.21
203 2013-01-08         19          1013       93.21
204 2013-01-08         23          1143       93.21
205 2013-01-08         24          2349       93.21
206 2013-01-08         25           626       93.21
207 2013-01-08         26           729       93.21
208 2013-01-08         27           999       93.21
209 2013-01-08         28           877       93.21
210 2013-01-08         30           701       93.21
211 2013-01-08         31          1200       93.21
212 2013-01-08         32           641       93.21
213 2013-01-08         33          1164       93.21
214 2013-01-08         34          2272       93.21
215 2013-01-08         35           555       93.21
216 2013-01-08         37          1366       93.21
217 2013-01-08         38          1331       93.21
218 2013-01-08         39          1417       93.21
219 2013-01-08         40          1090       93.21
220 2013-01-08         41           764       93.21
221 2013-01-08         43          1155       93.21
222 2013-01-08         44          3593       93.21
223 2013-01-08         45          3102       93.21
224 2013-01-08         46          3061       93.21
225 2013-01-08         47          3185       93.21
226 2013-01-08         48          2320       93.21
227 2013-01-08         49          1609       93.21
228 2013-01-08         50          2251       93.21
229 2013-01-08         51          1613       93.21
230 2013-01-08         54           729       93.21